Revit 2027 API
ParameterTypeId.StairsRailingPlacementOffset Property
 "Offset from Path"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingPlacementOffset { get; }
Public Shared ReadOnly Property StairsRailingPlacementOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingPlacementOffset {
	ForgeTypeId^ get ();
}
static member StairsRailingPlacementOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace